[
    { "id": 1, "name": "Marlin", "description": "A fast and powerful fish with a long bill and a large dorsal fin. Known for its speed and acrobatic leaps when hooked.", "length_m": 4.2, "weight_kg": 550 },
    { "id": 2, "name": "Swordfish", "description": "Characterized by its long, flat bill resembling a sword. Found in oceanic regions and known for its powerful swimming abilities.", "length_m": 3.5, "weight_kg": 300 },
    { "id": 3, "name": "Mahi-mahi", "description": "Also known as dolphinfish, mahi-mahi is a colorful and highly prized fish in sport fishing. It is known for its speed and agility.", "length_m": 1.8, "weight_kg": 25 },
    { "id": 4, "name": "Wahoo", "description": "A sleek and fast predatory fish found in tropical and subtropical waters. Known for its speed and powerful strikes.", "length_m": 1.5, "weight_kg": 35 },
    { "id": 5, "name": "Yellowfin Tuna", "description": "A large species of tuna found in tropical and subtropical waters. Known for its speed, strength, and high-quality meat.", "length_m": 2.1, "weight_kg": 150 },
    { "id": 6, "name": "Bluefin Tuna", "description": "One of the largest tuna species, prized for its rich flavor and high market value. Highly migratory and can reach impressive sizes.", "length_m": 3.2, "weight_kg": 250 },
    { "id": 7, "name": "Giant Trevally", "description": "A powerful predatory fish found in the tropical waters of the Indian and Pacific Oceans. Known for its strength and aggressive behavior.", "length_m": 1.2, "weight_kg": 45 },
    { "id": 8, "name": "Atlantic Sailfish", "description": "A species of billfish known for its distinctive sail-like dorsal fin and impressive speed. Found in the Atlantic Ocean.", "length_m": 3.8, "weight_kg": 200 },
    { "id": 9, "name": "Black Marlin", "description": "One of the largest marlin species, known for its incredible strength and powerful leaps when hooked. Found in tropical and subtropical waters.", "length_m": 4.5, "weight_kg": 600 },
    { "id": 10, "name": "Atlantic Blue Marlin", "description": "A highly sought-after game fish known for its size, speed, and strength. Found in the Atlantic Ocean.", "length_m": 4.8, "weight_kg": 700 },
    { "id": 11, "name": "Yellowtail Amberjack", "description": "A strong and fast-swimming fish found in temperate and tropical waters. Known for its delicious flesh and powerful fighting ability.", "length_m": 1.6, "weight_kg": 40 },
    { "id": 12, "name": "Atlantic Tarpon", "description": "A large, silver-colored fish known for its acrobatic leaps when hooked. Found in coastal waters of the Atlantic Ocean and the Gulf of Mexico.", "length_m": 2.4, "weight_kg": 120 },
    { "id": 13, "name": "Yellowfin Grouper", "description": "A large species of grouper found in the warm waters of the Atlantic Ocean and the Gulf of Mexico. Known for its impressive size and delicious taste.", "length_m": 1.9, "weight_kg": 80 },
    { "id": 14, "name": "Dogtooth Tuna", "description": "A powerful predatory fish found in tropical and subtropical waters. Known for its large size, sharp teeth, and powerful swimming ability.", "length_m": 2.5, "weight_kg": 180 },
    { "id": 15, "name": "Yellowfin Croaker", "description": "A species of croaker found along the Pacific coast of North and South America. Known for its yellow fins and distinctive croaking sound.", "length_m": 0.7, "weight_kg": 2 },
    { "id": 16, "name": "Goliath Grouper", "description": "One of the largest species of grouper, found in the warm waters of the Atlantic Ocean and the Gulf of Mexico. Known for its immense size and strength.", "length_m": 2.8, "weight_kg": 200 },
    { "id": 17, "name": "Atlantic Cod", "description": "A well-known species of fish found in the cold waters of the North Atlantic. Prized for its white flesh and versatility in cooking.", "length_m": 1.2, "weight_kg": 15 },
    { "id": 18, "name": "Barracuda", "description": "A predatory fish known for its long, slender body and sharp teeth. Found in tropical and subtropical oceans, often near coral reefs.", "length_m": 1.8, "weight_kg": 30 },
    { "id": 19, "name": "Great Barracuda", "description": "The largest species of barracuda, known for its aggressive behavior and impressive size. Found in warm coastal waters worldwide.", "length_m": 2.5, "weight_kg": 50 },
    { "id": 20, "name": "Yellowtail Kingfish", "description": "A powerful and fast-swimming fish found in temperate and tropical waters. Highly prized for its firm flesh and rich flavor.", "length_m": 1.5, "weight_kg": 35 },
    { "id": 21, "name": "Amberjack", "description": "A group of strong, fast-swimming fish found in temperate and tropical waters. Prized for their fighting ability and delicious flesh.", "length_m": 1.4, "weight_kg": 25 },
    { "id": 22, "name": "Kingfish", "description": "A powerful and fast-swimming fish found in temperate and tropical waters. Highly prized for its firm flesh and rich flavor.", "length_m": 1.7, "weight_kg": 20 },
    { "id": 23, "name": "Barramundi", "description": "A predatory fish found in the Indo-Pacific region. Known for its ability to thrive in both saltwater and freshwater habitats.", "length_m": 1.2, "weight_kg": 15 },
    { "id": 24, "name": "Cobia", "description": "A large, fast-swimming fish found in warm ocean waters. Known for its firm texture and mild flavor, often used in sushi.", "length_m": 1.8, "weight_kg": 40 },
    { "id": 25, "name": "Striped Bass", "description": "A popular game fish found in North America, prized for its fighting ability and delicious flesh. Known for its distinctive stripes along the length of its body.", "length_m": 1.2, "weight_kg": 12 },
    { "id": 26, "name": "Roosterfish", "description": "A prized game fish found in the Pacific Ocean, known for its distinctive appearance and powerful fighting ability. Named for the rooster-like comb on its head.", "length_m": 1.5, "weight_kg": 25 },
    { "id": 27, "name": "Red Snapper", "description": "A popular food fish found in the Gulf of Mexico and the southeastern United States. Prized for its sweet, nutty flavor and firm texture.", "length_m": 0.7, "weight_kg": 5 },
    { "id": 28, "name": "Yellowfin Grouper", "description": "A large species of grouper found in the warm waters of the Atlantic Ocean and the Gulf of Mexico. Known for its impressive size and delicious taste.", "length_m": 1.9, "weight_kg": 80 },
    { "id": 29, "name": "Dolphinfish", "description": "Also known as mahi-mahi or dorado, dolphinfish is a colorful and highly prized fish in sport fishing. Known for its speed and acrobatic leaps.", "length_m": 1.7, "weight_kg": 20 },
    { "id": 30, "name": "Atlantic Halibut", "description": "A large flatfish found in the cold waters of the North Atlantic. Prized for its mild, sweet flavor and firm texture, often served grilled or pan-fried.", "length_m": 1.8, "weight_kg": 25 }
]